const allData = [
  [`1日前`, `1 天前`],
  [`1時間前`, `1 小时前`],
  [`1分前`, `1 分钟前`],
  [`1か月前`, `1 个月前`],
  [`1年前`, `1 年前`],
  [`10日前`, `10 天前`],
  [`10時間前`, `10 小时前`],
  [`10分前`, `10 分钟前`],
  [`10か月前`, `10 个月前`],
  [`11日前`, `11 天前`],
  [`11 時間前`, `11 小时前`],
  [`11分前`, `11 分钟前`],
  [`11か月前`, `11 个月前`],
  [`12日前`, `12 天前`],
  [`12時間前`, `12 小时前`],
  [`12分前`, `12 分钟前`],
  [`13日前`, `13 天前`],
  [`13時間前`, `13 小时前`],
  [`13分前`, `13 分钟前`],
  [`14日前`, `14 天前`],
  [`14時間前`, `14 小时前`],
  [`14分前`, `14 分钟前`],
  [`15日前`, `15 天前`],
  [`15時間前`, `15 小时前`],
  [`15分前`, `15 分钟前`],
  [`16日前`, `16 天前`],
  [`16時間前`, `16 小时前`],
  [`16分前`, `16 分钟前`],
  [`17日前`, `17 天前`],
  [`17時間前`, `17 小时前`],
  [`17分前`, `17 分钟前`],
  [`18日前`, `18 天前`],
  [`18時間前`, `18 小时前`],
  [`18分前`, `18 分钟前`],
  [`19日前`, `19 天前`],
  [`19時間前`, `19 小时前`],
  [`19分前`, `19 分钟前`],
  [`2日前`, `2 天前`],
  [`2時間前`, `2 小时前`],
  [`2分前`, `2 分钟前`],
  [`2か月前`, `2 个月前`],
  [`2年前`, `2 年前`],
  [`20日前`, `20 天前`],
  [`20時間前`, `20 小时前`],
  [`20分前`, `20 分钟前`],
  [`21日前`, `21 天前`],
  [`21時間前`, `21 小时前`],
  [`21分前`, `21 分钟前`],
  [`22日前`, `22 天前`],
  [`22時間前`, `22 小时前`],
  [`22分前`, `22 分钟前`],
  [`23日前`, `23 天前`],
  [`23時間前`, `23 小时前`],
  [`23分前`, `23 分钟前`],
  [`24日前`, `24 天前`],
  [`24分前`, `24 分钟前`],
  [`25日前`, `25 天前`],
  [`25分前`, `25 分钟前`],
  [`26日前`, `26 天前`],
  [`26分前`, `26 分钟前`],
  [`27日前`, `27 天前`],
  [`27分前`, `27 分钟前`],
  [`28日前`, `28 天前`],
  [`28分前`, `28 分钟前`],
  [`29日前`, `29 天前`],
  [`29分前`, `29 分钟前`],
  [`3日前`, `3 天前`],
  [`3時間前`, `3 小时前`],
  [`3分前`, `3 分钟前`],
  [`3か月前`, `3 个月前`],
  [`30分前`, `30 分钟前`],
  [`31分前`, `31 分钟前`],
  [`32分前`, `32 分钟前`],
  [`33分前`, `33 分钟前`],
  [`34分前`, `34 分钟前`],
  [`35分前`, `35 分钟前`],
  [`36分前`, `36 分钟前`],
  [`37分前`, `37 分钟前`],
  [`38分前`, `38 分钟前`],
  [`39分前`, `39 分钟前`],
  [`4日前`, `4 天前`],
  [`4時間前`, `4 小时前`],
  [`4分前`, `4 分钟前`],
  [`4か月前`, `4 个月前`],
  [`40分前`, `40 分钟前`],
  [`41分前`, `41 分钟前`],
  [`42分前`, `42 分钟前`],
  [`43分前`, `43 分钟前`],
  [`44分前`, `44 分钟前`],
  [`45分前`, `45 分钟前`],
  [`46分前`, `46 分钟前`],
  [`47分前`, `47 分钟前`],
  [`48分前`, `48 分钟前`],
  [`49分前`, `49 分钟前`],
  [`5日前`, `5 天前`],
  [`5時間前`, `5 小时前`],
  [`5分前`, `5 分钟前`],
  [`5か月前`, `5 个月前`],
  [`50分前`, `50 分钟前`],
  [`51分前`, `51 分钟前`],
  [`52分前`, `52 分钟前`],
  [`53分前`, `53 分钟前`],
  [`54分前`, `54 分钟前`],
  [`55分前`, `55 分钟前`],
  [`56分前`, `56 分钟前`],
  [`57分前`, `57 分钟前`],
  [`58分前`, `58 分钟前`],
  [`59分前`, `59 分钟前`],
  [`6日前`, `6 天前`],
  [`6時間前`, `6 小时前`],
  [`6分前`, `6 分钟前`],
  [`6か月前`, `6 个月前`],
  [`7日前`, `7 天前`],
  [`7時間前`, `7 小时前`],
  [`7分前`, `7 分钟前`],
  [`7か月前`, `7 个月前`],
  [`8日前`, `8 天前`],
  [`8時間前`, `8 小时前`],
  [`8分前`, `8 分钟前`],
  [`8か月前`, `8 个月前`],
  [`9日前`, `9 天前`],
  [`9時間前`, `9 小时前`],
  [`9分前`, `9 分钟前`],
  [`9か月前`, `9 个月前`],
]


let MutationObserver = window.MutationObserver || window.WebKitMutationObserver;
let MutationObserverConfig = {
  childList: true,
  subtree: true,
  attributeFilter: ['data-label'],
  characterData: true
};

let observer = new MutationObserver(function (mutations) {
  let treeWalker = document.createTreeWalker(
  document.body,
  NodeFilter.SHOW_ALL,
  { 
    acceptNode: function (node) {
      if (node.nodeType === 3 || (node.hasAttribute && (node.hasAttribute('data-label') || node.hasAttribute('placeholder')))) {
        return NodeFilter.FILTER_ACCEPT;
      } else {
        return NodeFilter.FILTER_SKIP;
      }
    } 
  },
  false
  );
  let dataMap = new Map();
  allData.forEach(([key, val]) => {
  if (key && !dataMap.has(key)) {
    dataMap.set(key, val);
  }
  });
  let currentNode = treeWalker.currentNode;
  while (currentNode) {
  if (currentNode.nodeType === 3) {
    let key1 = currentNode.textContent;
    if (dataMap.has(key1)) currentNode.textContent = dataMap.get(key1);
  } else {
    let key2 = currentNode.getAttribute('data-label');
    if (key2 && dataMap.has(key2)) currentNode.setAttribute('data-label', dataMap.get(key2));
    let key3 = currentNode.getAttribute('placeholder') || '';
    if (key3 = key3.trim()) {
      if (dataMap.has(key3)) currentNode.setAttribute('placeholder', dataMap.get(key3));
    }
  }

  currentNode = treeWalker.nextNode();
  }
});

observer.observe(document.body, MutationObserverConfig);
